CoreMaker-lab/STM32C542CC_IIS2ICLX/STM32C5_IIS2ICLX_Project2/STM32C5_IIS3DWB_Project2_cmake/iis2iclx_reg.h
#define IIS2ICLX_SLV3_ADD                     0x1EU
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t r_3                      : 1;
  uint8_t slave3_add               : 7;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t slave3_add               : 7;
  uint8_t r_3                      : 1;
#endif /* DRV_BYTE_ORDER */
} iis2iclx_slv3_add_t;

#define IIS2ICLX_SLV3_SUBADD                  0x1FU
typedef struct
{
  uint8_t slave3_reg               : 8;
} iis2iclx_slv3_subadd_t;

#define IIS2ICLX_SLV3_CONFIG                  0x20U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t slave3_numop             : 3;
  uint8_t batch_ext_sens_3_en      : 1;
  uint8_t not_used_01              : 4;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t not_used_01              : 4;
  uint8_t batch_ext_sens_3_en      : 1;
  uint8_t slave3_numop             : 3;
#endif /* DRV_BYTE_ORDER */
} iis2iclx_slv3_config_t;

#define IIS2ICLX_DATAWRITE_SLV0  0x21U
typedef struct
{
  uint8_t slave0_dataw             : 8;
} iis2iclx_datawrite_slv0_t;

#define IIS2ICLX_STATUS_MASTER                0x22U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sens_hub_endop           : 1;
  uint8_t not_used_01              : 2;
  uint8_t slave0_nack              : 1;
  uint8_t slave1_nack              : 1;
  uint8_t slave2_nack              : 1;
  uint8_t slave3_nack              : 1;
  uint8_t wr_once_done             : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t wr_once_done             : 1;
  uint8_t slave3_nack              : 1;
  uint8_t slave2_nack              : 1;
  uint8_t slave1_nack              : 1;
  uint8_t slave0_nack              : 1;
  uint8_t not_used_01              : 2;
  uint8_t sens_hub_endop           : 1;
#endif /* DRV_BYTE_ORDER */
} iis2iclx_status_master_t;

/**
  * @defgroup IIS2ICLX_Register_Union
  * @brief    This union group all the registers having a bit-field
  *           description.
  *           This union is useful but it's not needed by the driver.
  *
  *           REMOVING this union you are compliant with:
  *           MISRA-C 2012 [Rule 19.2] -> " Union are not allowed "
  *
  * @{
  *
  */
typedef union
{
  iis2iclx_func_cfg_access_t               func_cfg_access;
  iis2iclx_pin_ctrl_t                      pin_ctrl;
  iis2iclx_fifo_ctrl1_t                    fifo_ctrl1;
  iis2iclx_fifo_ctrl2_t                    fifo_ctrl2;
  iis2iclx_fifo_ctrl3_t                    fifo_ctrl3;
  iis2iclx_fifo_ctrl4_t                    fifo_ctrl4;
  iis2iclx_counter_bdr_reg1_t              counter_bdr_reg1;
  iis2iclx_counter_bdr_reg2_t              counter_bdr_reg2;
  iis2iclx_int1_ctrl_t                     int1_ctrl;
  iis2iclx_int2_ctrl_t                     int2_ctrl;
  iis2iclx_ctrl1_xl_t                      ctrl1_xl;
  iis2iclx_ctrl3_c_t                       ctrl3_c;
  iis2iclx_ctrl4_c_t                       ctrl4_c;
  iis2iclx_ctrl5_c_t                       ctrl5_c;
  iis2iclx_ctrl6_c_t                       ctrl6_c;
  iis2iclx_ctrl7_xl_t                      ctrl7_xl;
  iis2iclx_ctrl8_xl_t                      ctrl8_xl;
  iis2iclx_ctrl9_xl_t                      ctrl9_xl;
  iis2iclx_ctrl10_c_t                      ctrl10_c;
  iis2iclx_all_int_src_t                   all_int_src;
  iis2iclx_wake_up_src_t                   wake_up_src;
  iis2iclx_tap_src_t                       tap_src;
  iis2iclx_den_src_t                       den_src;
  iis2iclx_status_reg_t                    status_reg;
  iis2iclx_fifo_status1_t                  fifo_status1;
  iis2iclx_fifo_status2_t                  fifo_status2;
  iis2iclx_tap_cfg0_t                      tap_cfg0;
  iis2iclx_tap_cfg1_t                      tap_cfg1;
  iis2iclx_tap_cfg2_t                      tap_cfg2;
  iis2iclx_int_dur2_t                      int_dur2;
  iis2iclx_wake_up_ths_t                   wake_up_ths;
  iis2iclx_wake_up_dur_t                   wake_up_dur;
  iis2iclx_md1_cfg_t                       md1_cfg;
  iis2iclx_md2_cfg_t                       md2_cfg;
  iis2iclx_internal_freq_fine_t            internal_freq_fine;
  iis2iclx_fifo_data_out_tag_t             fifo_data_out_tag;
  iis2iclx_page_sel_t                      page_sel;
  iis2iclx_emb_func_en_b_t                 emb_func_en_b;
  iis2iclx_page_address_t                  page_address;
  iis2iclx_page_value_t                    page_value;
  iis2iclx_emb_func_int1_t                 emb_func_int1;
  iis2iclx_fsm_int1_a_t                    fsm_int1_a;
  iis2iclx_fsm_int1_b_t                    fsm_int1_b;
  iis2iclx_mlc_int1_t                      mlc_int1;
  iis2iclx_emb_func_int2_t                 emb_func_int2;
  iis2iclx_fsm_int2_a_t                    fsm_int2_a;
  iis2iclx_fsm_int2_b_t                    fsm_int2_b;
  iis2iclx_mlc_int2_t                      mlc_int2;
  iis2iclx_emb_func_status_t               emb_func_status;
  iis2iclx_fsm_status_a_t                  fsm_status_a;
  iis2iclx_fsm_status_b_t                  fsm_status_b;
  iis2iclx_mlc_status_mainpage_t           mlc_status_mainpage;
  iis2iclx_emb_func_odr_cfg_c_t            emb_func_odr_cfg_c;
  iis2iclx_page_rw_t                       page_rw;
  iis2iclx_fsm_enable_a_t                  fsm_enable_a;
  iis2iclx_fsm_enable_b_t                  fsm_enable_b;
  iis2iclx_fsm_long_counter_clear_t        fsm_long_counter_clear;
  iis2iclx_fsm_outs1_t                     fsm_outs1;
  iis2iclx_fsm_outs2_t                     fsm_outs2;
  iis2iclx_fsm_outs3_t                     fsm_outs3;
  iis2iclx_fsm_outs4_t                     fsm_outs4;
  iis2iclx_fsm_outs5_t                     fsm_outs5;
  iis2iclx_fsm_outs6_t                     fsm_outs6;
  iis2iclx_fsm_outs7_t                     fsm_outs7;
  iis2iclx_fsm_outs8_t                     fsm_outs8;
  iis2iclx_fsm_outs9_t                     fsm_outs9;
  iis2iclx_fsm_outs10_t                    fsm_outs10;
  iis2iclx_fsm_outs11_t                    fsm_outs11;
  iis2iclx_fsm_outs12_t                    fsm_outs12;
  iis2iclx_fsm_outs13_t                    fsm_outs13;
  iis2iclx_fsm_outs14_t                    fsm_outs14;
  iis2iclx_fsm_outs15_t                    fsm_outs15;
  iis2iclx_fsm_outs16_t                    fsm_outs16;
  iis2iclx_emb_func_odr_cfg_b_t            emb_func_odr_cfg_b;
  iis2iclx_emb_func_init_b_t               emb_func_init_b;
  iis2iclx_sensor_hub_1_t                  sensor_hub_1;
  iis2iclx_sensor_hub_2_t                  sensor_hub_2;
  iis2iclx_sensor_hub_3_t                  sensor_hub_3;
  iis2iclx_sensor_hub_4_t                  sensor_hub_4;
  iis2iclx_sensor_hub_5_t                  sensor_hub_5;
  iis2iclx_sensor_hub_6_t                  sensor_hub_6;
  iis2iclx_sensor_hub_7_t                  sensor_hub_7;
  iis2iclx_sensor_hub_8_t                  sensor_hub_8;
  iis2iclx_sensor_hub_9_t                  sensor_hub_9;
  iis2iclx_sensor_hub_10_t                 sensor_hub_10;
  iis2iclx_sensor_hub_11_t                 sensor_hub_11;
  iis2iclx_sensor_hub_12_t                 sensor_hub_12;
  iis2iclx_sensor_hub_13_t                 sensor_hub_13;
  iis2iclx_sensor_hub_14_t                 sensor_hub_14;
  iis2iclx_sensor_hub_15_t                 sensor_hub_15;
  iis2iclx_sensor_hub_16_t                 sensor_hub_16;
  iis2iclx_sensor_hub_17_t                 sensor_hub_17;
  iis2iclx_sensor_hub_18_t                 sensor_hub_18;
  iis2iclx_master_config_t                 master_config;
  iis2iclx_slv0_add_t                      slv0_add;
  iis2iclx_slv0_subadd_t                   slv0_subadd;
  iis2iclx_slv0_config_t                   slv0_config;
  iis2iclx_slv1_add_t                      slv1_add;
  iis2iclx_slv1_subadd_t                   slv1_subadd;
  iis2iclx_slv1_config_t                   slv1_config;
  iis2iclx_slv2_add_t                      slv2_add;
  iis2iclx_slv2_subadd_t                   slv2_subadd;
  iis2iclx_slv2_config_t                   slv2_config;
  iis2iclx_slv3_add_t                      slv3_add;
  iis2iclx_slv3_subadd_t                   slv3_subadd;
  iis2iclx_slv3_config_t                   slv3_config;
  iis2iclx_datawrite_slv0_t                datawrite_slv0;
  iis2iclx_status_master_t                 status_master;
  bitwise_t                               bitwise;
  uint8_t                                 byte;
} iis2iclx_reg_t;

/**
  * @}
  *
  */

#ifndef __weak
#define __weak __attribute__((weak))
#endif /* __weak */

