CoreMaker-lab/STM32C542CC_IIS2ICLX/STM32C5_IIS2ICLX_Project2/STM32C5_IIS3DWB_Project2_cmake/iis2iclx_reg.h
/*
 * These are the basic platform dependent I/O routines to read
 * and write device registers connected on a standard bus.
 * The driver keeps offering a default implementation based on function
 * pointers to read/write routines for backward compatibility.
 * The __weak directive allows the final application to overwrite
 * them with a custom implementation.
 */

int32_t iis2iclx_read_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                          uint8_t *data,
                          uint16_t len);
int32_t iis2iclx_write_reg(const stmdev_ctx_t *ctx, uint8_t reg,
                           const uint8_t *data,
                           uint16_t len);

float_t iis2iclx_from_fs500mg_to_mg(int16_t lsb);
float_t iis2iclx_from_fs1g_to_mg(int16_t lsb);
float_t iis2iclx_from_fs2g_to_mg(int16_t lsb);
float_t iis2iclx_from_fs3g_to_mg(int16_t lsb);

float_t iis2iclx_from_lsb_to_celsius(int16_t lsb);

float_t iis2iclx_from_lsb_to_nsec(int32_t lsb);

typedef enum
{
  IIS2ICLX_500mg   = 0,
  IIS2ICLX_3g      = 1,
  IIS2ICLX_1g      = 2,
  IIS2ICLX_2g      = 3,
} iis2iclx_fs_xl_t;
int32_t iis2iclx_xl_full_scale_set(const stmdev_ctx_t *ctx,
                                   iis2iclx_fs_xl_t val);
int32_t iis2iclx_xl_full_scale_get(const stmdev_ctx_t *ctx,
                                   iis2iclx_fs_xl_t *val);

typedef enum
{
  IIS2ICLX_XL_ODR_OFF    = 0,
  IIS2ICLX_XL_ODR_12Hz5  = 1,
  IIS2ICLX_XL_ODR_26Hz   = 2,
  IIS2ICLX_XL_ODR_52Hz   = 3,
  IIS2ICLX_XL_ODR_104Hz  = 4,
  IIS2ICLX_XL_ODR_208Hz  = 5,
  IIS2ICLX_XL_ODR_416Hz  = 6,
  IIS2ICLX_XL_ODR_833Hz  = 7,
} iis2iclx_odr_xl_t;
int32_t iis2iclx_xl_data_rate_set(const stmdev_ctx_t *ctx,
                                  iis2iclx_odr_xl_t val);
int32_t iis2iclx_xl_data_rate_get(const stmdev_ctx_t *ctx,
                                  iis2iclx_odr_xl_t *val);

int32_t iis2iclx_block_data_update_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t iis2iclx_block_data_update_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

typedef enum
{
  IIS2ICLX_LSb_1mg  = 0,
  IIS2ICLX_LSb_16mg = 1,
} iis2iclx_usr_off_w_t;
int32_t iis2iclx_xl_offset_weight_set(const stmdev_ctx_t *ctx,
                                      iis2iclx_usr_off_w_t val);
int32_t iis2iclx_xl_offset_weight_get(const stmdev_ctx_t *ctx,
                                      iis2iclx_usr_off_w_t *val);

typedef struct
{
  iis2iclx_all_int_src_t       all_int_src;
  iis2iclx_wake_up_src_t       wake_up_src;
  iis2iclx_tap_src_t           tap_src;
  iis2iclx_den_src_t           den_src;
  iis2iclx_status_reg_t        status_reg;
  iis2iclx_emb_func_status_t   emb_func_status;
  iis2iclx_fsm_status_a_t      fsm_status_a;
  iis2iclx_fsm_status_b_t      fsm_status_b;
} iis2iclx_all_sources_t;
int32_t iis2iclx_all_sources_get(const stmdev_ctx_t *ctx,
                                 iis2iclx_all_sources_t *val);

int32_t iis2iclx_status_reg_get(const stmdev_ctx_t *ctx,
                                iis2iclx_status_reg_t *val);

int32_t iis2iclx_xl_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t iis2iclx_temp_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                          uint8_t *val);

int32_t iis2iclx_xl_usr_offset_x_set(const stmdev_ctx_t *ctx,
                                     uint8_t *buff);
int32_t iis2iclx_xl_usr_offset_x_get(const stmdev_ctx_t *ctx,
                                     uint8_t *buff);

int32_t iis2iclx_xl_usr_offset_y_set(const stmdev_ctx_t *ctx,
                                     uint8_t *buff);
int32_t iis2iclx_xl_usr_offset_y_get(const stmdev_ctx_t *ctx,
                                     uint8_t *buff);

int32_t iis2iclx_xl_usr_offset_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_xl_usr_offset_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_timestamp_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_timestamp_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_timestamp_raw_get(const stmdev_ctx_t *ctx, int32_t *val);

int32_t iis2iclx_temperature_raw_get(const stmdev_ctx_t *ctx, int16_t *val);

int32_t iis2iclx_acceleration_raw_get(const stmdev_ctx_t *ctx,
                                      int16_t *val);

int32_t iis2iclx_fifo_out_raw_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t iis2iclx_device_conf_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_device_conf_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_odr_cal_reg_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_odr_cal_reg_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  IIS2ICLX_USER_BANK           = 0,
  IIS2ICLX_SENSOR_HUB_BANK     = 1,
  IIS2ICLX_EMBEDDED_FUNC_BANK  = 2,
} iis2iclx_reg_access_t;
int32_t iis2iclx_mem_bank_set(const stmdev_ctx_t *ctx,
                              iis2iclx_reg_access_t val);
int32_t iis2iclx_mem_bank_get(const stmdev_ctx_t *ctx,
                              iis2iclx_reg_access_t *val);

int32_t iis2iclx_ln_pg_write_byte(const stmdev_ctx_t *ctx, uint16_t add,
                                  uint8_t *val);
int32_t iis2iclx_ln_pg_write(const stmdev_ctx_t *ctx, uint16_t add,
                             uint8_t *buf, uint8_t len);
int32_t iis2iclx_ln_pg_read_byte(const stmdev_ctx_t *ctx, uint16_t add,
                                 uint8_t *val);

typedef enum
{
  IIS2ICLX_DRDY_LATCHED = 0,
  IIS2ICLX_DRDY_PULSED  = 1,
} iis2iclx_dataready_pulsed_t;
int32_t iis2iclx_data_ready_mode_set(const stmdev_ctx_t *ctx,
                                     iis2iclx_dataready_pulsed_t val);
int32_t iis2iclx_data_ready_mode_get(const stmdev_ctx_t *ctx,
                                     iis2iclx_dataready_pulsed_t *val);

int32_t iis2iclx_device_id_get(const stmdev_ctx_t *ctx, uint8_t *buff);

int32_t iis2iclx_reset_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_auto_increment_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_auto_increment_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_boot_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_boot_get(const stmdev_ctx_t *ctx, uint8_t *val);

