CoreMaker-lab/STM32C542CC_IIS2ICLX/STM32C5_IIS2ICLX_Project2/STM32C5_IIS3DWB_Project2_cmake/iis2iclx_reg.h
typedef enum
{
  IIS2ICLX_XL_ST_DISABLE  = 0,
  IIS2ICLX_XL_ST_POSITIVE = 1,
  IIS2ICLX_XL_ST_NEGATIVE = 2,
} iis2iclx_st_xl_t;
int32_t iis2iclx_xl_self_test_set(const stmdev_ctx_t *ctx,
                                  iis2iclx_st_xl_t val);
int32_t iis2iclx_xl_self_test_get(const stmdev_ctx_t *ctx,
                                  iis2iclx_st_xl_t *val);

int32_t iis2iclx_xl_filter_lp2_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_xl_filter_lp2_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_filter_settling_mask_set(const stmdev_ctx_t *ctx,
                                          uint8_t val);
int32_t iis2iclx_filter_settling_mask_get(const stmdev_ctx_t *ctx,
                                          uint8_t *val);

typedef enum
{
  IIS2ICLX_HP_REF_MODE               = 0x37,
  IIS2ICLX_SLOPE_ODR_DIV_4           = 0x10,
  IIS2ICLX_HP_ODR_DIV_10             = 0x11,
  IIS2ICLX_HP_ODR_DIV_20             = 0x12,
  IIS2ICLX_HP_ODR_DIV_45             = 0x13,
  IIS2ICLX_HP_ODR_DIV_100            = 0x14,
  IIS2ICLX_HP_ODR_DIV_200            = 0x15,
  IIS2ICLX_HP_ODR_DIV_400            = 0x16,
  IIS2ICLX_HP_ODR_DIV_800            = 0x17,
  IIS2ICLX_LP_ODR_DIV_2              = 0x00,
  IIS2ICLX_LP_ODR_DIV_4              = 0x80,
  IIS2ICLX_LP_ODR_DIV_10             = 0x81,
  IIS2ICLX_LP_ODR_DIV_20             = 0x82,
  IIS2ICLX_LP_ODR_DIV_45             = 0x83,
  IIS2ICLX_LP_ODR_DIV_100            = 0x84,
  IIS2ICLX_LP_ODR_DIV_200            = 0x85,
  IIS2ICLX_LP_ODR_DIV_400            = 0x86,
  IIS2ICLX_LP_ODR_DIV_800            = 0x87,
} iis2iclx_hp_slope_xl_en_t;
int32_t iis2iclx_xl_hp_path_on_out_set(const stmdev_ctx_t *ctx,
                                       iis2iclx_hp_slope_xl_en_t val);
int32_t iis2iclx_xl_hp_path_on_out_get(const stmdev_ctx_t *ctx,
                                       iis2iclx_hp_slope_xl_en_t *val);

int32_t iis2iclx_xl_fast_settling_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_xl_fast_settling_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum
{
  IIS2ICLX_USE_SLOPE = 0,
  IIS2ICLX_USE_HPF   = 1,
} iis2iclx_slope_fds_t;
int32_t iis2iclx_xl_hp_path_internal_set(const stmdev_ctx_t *ctx,
                                         iis2iclx_slope_fds_t val);
int32_t iis2iclx_xl_hp_path_internal_get(const stmdev_ctx_t *ctx,
                                         iis2iclx_slope_fds_t *val);

typedef enum
{
  IIS2ICLX_PULL_UP_DISC       = 0,
  IIS2ICLX_PULL_UP_CONNECT    = 1,
} iis2iclx_sdo_pu_en_t;
int32_t iis2iclx_sdo_sa0_mode_set(const stmdev_ctx_t *ctx,
                                  iis2iclx_sdo_pu_en_t val);
int32_t iis2iclx_sdo_sa0_mode_get(const stmdev_ctx_t *ctx,
                                  iis2iclx_sdo_pu_en_t *val);

typedef enum
{
  IIS2ICLX_SPI_4_WIRE = 0,
  IIS2ICLX_SPI_3_WIRE = 1,
} iis2iclx_sim_t;
int32_t iis2iclx_spi_mode_set(const stmdev_ctx_t *ctx, iis2iclx_sim_t val);
int32_t iis2iclx_spi_mode_get(const stmdev_ctx_t *ctx, iis2iclx_sim_t *val);

typedef enum
{
  IIS2ICLX_I2C_ENABLE  = 0,
  IIS2ICLX_I2C_DISABLE = 1,
} iis2iclx_i2c_disable_t;
int32_t iis2iclx_i2c_interface_set(const stmdev_ctx_t *ctx,
                                   iis2iclx_i2c_disable_t val);
int32_t iis2iclx_i2c_interface_get(const stmdev_ctx_t *ctx,
                                   iis2iclx_i2c_disable_t *val);

typedef struct
{
  iis2iclx_int1_ctrl_t          int1_ctrl;
  iis2iclx_md1_cfg_t            md1_cfg;
  iis2iclx_emb_func_int1_t      emb_func_int1;
  iis2iclx_fsm_int1_a_t         fsm_int1_a;
  iis2iclx_fsm_int1_b_t         fsm_int1_b;
  iis2iclx_mlc_int1_t           mlc_int1;
} iis2iclx_pin_int1_route_t;
int32_t iis2iclx_pin_int1_route_set(const stmdev_ctx_t *ctx,
                                    iis2iclx_pin_int1_route_t *val);
int32_t iis2iclx_pin_int1_route_get(const stmdev_ctx_t *ctx,
                                    iis2iclx_pin_int1_route_t *val);

typedef struct
{
  iis2iclx_int2_ctrl_t          int2_ctrl;
  iis2iclx_md2_cfg_t            md2_cfg;
  iis2iclx_emb_func_int2_t      emb_func_int2;
  iis2iclx_fsm_int2_a_t         fsm_int2_a;
  iis2iclx_fsm_int2_b_t         fsm_int2_b;
  iis2iclx_mlc_int2_t           mlc_int2;
} iis2iclx_pin_int2_route_t;
int32_t iis2iclx_pin_int2_route_set(const stmdev_ctx_t *ctx,
                                    iis2iclx_pin_int2_route_t *val);
int32_t iis2iclx_pin_int2_route_get(const stmdev_ctx_t *ctx,
                                    iis2iclx_pin_int2_route_t *val);

typedef enum
{
  IIS2ICLX_PUSH_PULL   = 0,
  IIS2ICLX_OPEN_DRAIN  = 1,
} iis2iclx_pp_od_t;
int32_t iis2iclx_pin_mode_set(const stmdev_ctx_t *ctx,
                              iis2iclx_pp_od_t val);
int32_t iis2iclx_pin_mode_get(const stmdev_ctx_t *ctx,
                              iis2iclx_pp_od_t *val);

typedef enum
{
  IIS2ICLX_ACTIVE_HIGH = 0,
  IIS2ICLX_ACTIVE_LOW  = 1,
} iis2iclx_h_lactive_t;
int32_t iis2iclx_pin_polarity_set(const stmdev_ctx_t *ctx,
                                  iis2iclx_h_lactive_t val);
int32_t iis2iclx_pin_polarity_get(const stmdev_ctx_t *ctx,
                                  iis2iclx_h_lactive_t *val);

int32_t iis2iclx_all_on_int1_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_all_on_int1_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  IIS2ICLX_ALL_INT_PULSED            = 0,
  IIS2ICLX_BASE_LATCHED_EMB_PULSED   = 1,
  IIS2ICLX_BASE_PULSED_EMB_LATCHED   = 2,
  IIS2ICLX_ALL_INT_LATCHED           = 3,
} iis2iclx_lir_t;
int32_t iis2iclx_int_notification_set(const stmdev_ctx_t *ctx,
                                      iis2iclx_lir_t val);
int32_t iis2iclx_int_notification_get(const stmdev_ctx_t *ctx,
                                      iis2iclx_lir_t *val);

typedef enum
{
  IIS2ICLX_LSb_FS_DIV_64       = 0,
  IIS2ICLX_LSb_FS_DIV_256      = 1,
} iis2iclx_wake_ths_w_t;
int32_t iis2iclx_wkup_ths_weight_set(const stmdev_ctx_t *ctx,
                                     iis2iclx_wake_ths_w_t val);
int32_t iis2iclx_wkup_ths_weight_get(const stmdev_ctx_t *ctx,
                                     iis2iclx_wake_ths_w_t *val);

int32_t iis2iclx_wkup_threshold_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_wkup_threshold_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_xl_usr_offset_on_wkup_set(const stmdev_ctx_t *ctx,
                                           uint8_t val);
int32_t iis2iclx_xl_usr_offset_on_wkup_get(const stmdev_ctx_t *ctx,
                                           uint8_t *val);

int32_t iis2iclx_wkup_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_wkup_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

