CoreMaker-lab/STM32C542CC_IIS2ICLX/STM32C5_IIS2ICLX_Project2/STM32C5_IIS3DWB_Project2_cmake/iis2iclx_reg.h
typedef enum
{
  IIS2ICLX_DRIVE_SLEEP_CHG_EVENT = 0,
  IIS2ICLX_DRIVE_SLEEP_STATUS    = 1,
} iis2iclx_sleep_status_on_int_t;
int32_t iis2iclx_act_pin_notification_set(const stmdev_ctx_t *ctx,
                                          iis2iclx_sleep_status_on_int_t val);
int32_t iis2iclx_act_pin_notification_get(const stmdev_ctx_t *ctx,
                                          iis2iclx_sleep_status_on_int_t *val);

int32_t iis2iclx_act_sleep_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_act_sleep_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_tap_detection_on_y_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t iis2iclx_tap_detection_on_y_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t iis2iclx_tap_detection_on_x_set(const stmdev_ctx_t *ctx,
                                        uint8_t val);
int32_t iis2iclx_tap_detection_on_x_get(const stmdev_ctx_t *ctx,
                                        uint8_t *val);

int32_t iis2iclx_tap_threshold_x_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_tap_threshold_x_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  IIS2ICLX_XY = 0,
  IIS2ICLX_YX = 1,
} iis2iclx_tap_priority_t;
int32_t iis2iclx_tap_axis_priority_set(const stmdev_ctx_t *ctx,
                                       iis2iclx_tap_priority_t val);
int32_t iis2iclx_tap_axis_priority_get(const stmdev_ctx_t *ctx,
                                       iis2iclx_tap_priority_t *val);

int32_t iis2iclx_tap_threshold_y_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_tap_threshold_y_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_tap_shock_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_tap_shock_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_tap_quiet_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_tap_quiet_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_tap_dur_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_tap_dur_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  IIS2ICLX_ONLY_SINGLE        = 0,
  IIS2ICLX_BOTH_SINGLE_DOUBLE = 1,
} iis2iclx_single_double_tap_t;
int32_t iis2iclx_tap_mode_set(const stmdev_ctx_t *ctx,
                              iis2iclx_single_double_tap_t val);
int32_t iis2iclx_tap_mode_get(const stmdev_ctx_t *ctx,
                              iis2iclx_single_double_tap_t *val);

int32_t iis2iclx_fifo_watermark_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t iis2iclx_fifo_watermark_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t iis2iclx_fifo_virtual_sens_odr_chg_set(const stmdev_ctx_t *ctx,
                                               uint8_t val);
int32_t iis2iclx_fifo_virtual_sens_odr_chg_get(const stmdev_ctx_t *ctx,
                                               uint8_t *val);

int32_t iis2iclx_fifo_stop_on_wtm_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_fifo_stop_on_wtm_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum
{
  IIS2ICLX_XL_NOT_BATCHED        =  0,
  IIS2ICLX_XL_BATCHED_AT_1Hz6    = 11,
  IIS2ICLX_XL_BATCHED_AT_12Hz5   =  1,
  IIS2ICLX_XL_BATCHED_AT_26Hz    =  2,
  IIS2ICLX_XL_BATCHED_AT_52Hz    =  3,
  IIS2ICLX_XL_BATCHED_AT_104Hz   =  4,
  IIS2ICLX_XL_BATCHED_AT_208Hz   =  5,
  IIS2ICLX_XL_BATCHED_AT_417Hz   =  6,
  IIS2ICLX_XL_BATCHED_AT_833Hz   =  7,
} iis2iclx_bdr_xl_t;
int32_t iis2iclx_fifo_xl_batch_set(const stmdev_ctx_t *ctx,
                                   iis2iclx_bdr_xl_t val);
int32_t iis2iclx_fifo_xl_batch_get(const stmdev_ctx_t *ctx,
                                   iis2iclx_bdr_xl_t *val);

typedef enum
{
  IIS2ICLX_BYPASS_MODE             = 0,
  IIS2ICLX_FIFO_MODE               = 1,
  IIS2ICLX_STREAM_TO_FIFO_MODE     = 3,
  IIS2ICLX_BYPASS_TO_STREAM_MODE   = 4,
  IIS2ICLX_STREAM_MODE             = 6,
  IIS2ICLX_BYPASS_TO_FIFO_MODE     = 7,
} iis2iclx_fifo_mode_t;
int32_t iis2iclx_fifo_mode_set(const stmdev_ctx_t *ctx,
                               iis2iclx_fifo_mode_t val);
int32_t iis2iclx_fifo_mode_get(const stmdev_ctx_t *ctx,
                               iis2iclx_fifo_mode_t *val);

typedef enum
{
  IIS2ICLX_TEMP_NOT_BATCHED        = 0,
  IIS2ICLX_TEMP_BATCHED_AT_1Hz6    = 1,
  IIS2ICLX_TEMP_BATCHED_AT_12Hz5   = 2,
  IIS2ICLX_TEMP_BATCHED_AT_52Hz    = 3,
} iis2iclx_odr_t_batch_t;
int32_t iis2iclx_fifo_temp_batch_set(const stmdev_ctx_t *ctx,
                                     iis2iclx_odr_t_batch_t val);
int32_t iis2iclx_fifo_temp_batch_get(const stmdev_ctx_t *ctx,
                                     iis2iclx_odr_t_batch_t *val);

typedef enum
{
  IIS2ICLX_NO_DECIMATION = 0,
  IIS2ICLX_DEC_1         = 1,
  IIS2ICLX_DEC_8         = 2,
  IIS2ICLX_DEC_32        = 3,
} iis2iclx_odr_ts_batch_t;
int32_t iis2iclx_fifo_timestamp_decimation_set(const stmdev_ctx_t *ctx,
                                               iis2iclx_odr_ts_batch_t val);
int32_t iis2iclx_fifo_timestamp_decimation_get(const stmdev_ctx_t *ctx,
                                               iis2iclx_odr_ts_batch_t *val);

int32_t iis2iclx_rst_batch_counter_set(const stmdev_ctx_t *ctx,
                                       uint8_t val);
int32_t iis2iclx_rst_batch_counter_get(const stmdev_ctx_t *ctx,
                                       uint8_t *val);

int32_t iis2iclx_batch_counter_threshold_set(const stmdev_ctx_t *ctx,
                                             uint16_t val);
int32_t iis2iclx_batch_counter_threshold_get(const stmdev_ctx_t *ctx,
                                             uint16_t *val);

int32_t iis2iclx_fifo_data_level_get(const stmdev_ctx_t *ctx,
                                     uint16_t *val);

int32_t iis2iclx_fifo_status_get(const stmdev_ctx_t *ctx,
                                 iis2iclx_fifo_status2_t *val);

int32_t iis2iclx_fifo_full_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_fifo_ovr_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_fifo_wtm_flag_get(const stmdev_ctx_t *ctx, uint8_t *val);

