CoreMaker-lab/STM32C542CC_IIS2ICLX/STM32C5_IIS2ICLX_Project2/STM32C5_IIS3DWB_Project2_cmake/iis2iclx_reg.h
typedef enum
{
  IIS2ICLX_XL_NC_TAG    = 2,
  IIS2ICLX_TEMPERATURE_TAG,
  IIS2ICLX_TIMESTAMP_TAG,
  IIS2ICLX_CFG_CHANGE_TAG,
  IIS2ICLX_SENSORHUB_SLAVE0_TAG,
  IIS2ICLX_SENSORHUB_SLAVE1_TAG,
  IIS2ICLX_SENSORHUB_SLAVE2_TAG,
  IIS2ICLX_SENSORHUB_SLAVE3_TAG,
  IIS2ICLX_SENSORHUB_NACK_TAG  = 0x19,
} iis2iclx_fifo_tag_t;
int32_t iis2iclx_fifo_sensor_tag_get(const stmdev_ctx_t *ctx,
                                     iis2iclx_fifo_tag_t *val);

int32_t iis2iclx_sh_batch_slave_0_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_sh_batch_slave_0_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t iis2iclx_sh_batch_slave_1_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_sh_batch_slave_1_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t iis2iclx_sh_batch_slave_2_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_sh_batch_slave_2_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

int32_t iis2iclx_sh_batch_slave_3_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_sh_batch_slave_3_get(const stmdev_ctx_t *ctx,
                                      uint8_t *val);

typedef enum
{
  IIS2ICLX_DEN_DISABLE    = 0x00,
  IIS2ICLX_LEVEL_FIFO     = 0x76,
  IIS2ICLX_LEVEL_LETCHED  = 0x73,
  IIS2ICLX_LEVEL_TRIGGER  = 0x72,
  IIS2ICLX_EDGE_TRIGGER   = 0x74,
} iis2iclx_den_mode_t;
int32_t iis2iclx_den_mode_set(const stmdev_ctx_t *ctx,
                              iis2iclx_den_mode_t val);
int32_t iis2iclx_den_mode_get(const stmdev_ctx_t *ctx,
                              iis2iclx_den_mode_t *val);

typedef enum
{
  IIS2ICLX_DEN_ACT_LOW  = 0,
  IIS2ICLX_DEN_ACT_HIGH = 1,
} iis2iclx_den_lh_t;
int32_t iis2iclx_den_polarity_set(const stmdev_ctx_t *ctx,
                                  iis2iclx_den_lh_t val);
int32_t iis2iclx_den_polarity_get(const stmdev_ctx_t *ctx,
                                  iis2iclx_den_lh_t *val);

int32_t iis2iclx_den_mark_axis_x_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_den_mark_axis_x_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_den_mark_axis_y_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_den_mark_axis_y_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_long_cnt_flag_data_ready_get(const stmdev_ctx_t *ctx,
                                              uint8_t *val);

int32_t iis2iclx_emb_fsm_en_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_emb_fsm_en_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  iis2iclx_fsm_enable_a_t          fsm_enable_a;
  iis2iclx_fsm_enable_b_t          fsm_enable_b;
} iis2iclx_emb_fsm_enable_t;
int32_t iis2iclx_fsm_enable_set(const stmdev_ctx_t *ctx,
                                iis2iclx_emb_fsm_enable_t *val);
int32_t iis2iclx_fsm_enable_get(const stmdev_ctx_t *ctx,
                                iis2iclx_emb_fsm_enable_t *val);

int32_t iis2iclx_long_cnt_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t iis2iclx_long_cnt_get(const stmdev_ctx_t *ctx, uint16_t *val);

typedef enum
{
  IIS2ICLX_LC_NORMAL     = 0,
  IIS2ICLX_LC_CLEAR      = 1,
  IIS2ICLX_LC_CLEAR_DONE = 2,
} iis2iclx_fsm_lc_clr_t;
int32_t iis2iclx_long_clr_set(const stmdev_ctx_t *ctx,
                              iis2iclx_fsm_lc_clr_t val);
int32_t iis2iclx_long_clr_get(const stmdev_ctx_t *ctx,
                              iis2iclx_fsm_lc_clr_t *val);

typedef struct
{
  iis2iclx_fsm_outs1_t    fsm_outs1;
  iis2iclx_fsm_outs2_t    fsm_outs2;
  iis2iclx_fsm_outs3_t    fsm_outs3;
  iis2iclx_fsm_outs4_t    fsm_outs4;
  iis2iclx_fsm_outs5_t    fsm_outs5;
  iis2iclx_fsm_outs6_t    fsm_outs6;
  iis2iclx_fsm_outs7_t    fsm_outs7;
  iis2iclx_fsm_outs8_t    fsm_outs8;
  iis2iclx_fsm_outs9_t    fsm_outs9;
  iis2iclx_fsm_outs10_t    fsm_outs10;
  iis2iclx_fsm_outs11_t    fsm_outs11;
  iis2iclx_fsm_outs12_t    fsm_outs12;
  iis2iclx_fsm_outs13_t    fsm_outs13;
  iis2iclx_fsm_outs14_t    fsm_outs14;
  iis2iclx_fsm_outs15_t    fsm_outs15;
  iis2iclx_fsm_outs16_t    fsm_outs16;
} iis2iclx_fsm_out_t;
int32_t iis2iclx_fsm_out_get(const stmdev_ctx_t *ctx,
                             iis2iclx_fsm_out_t *val);

typedef enum
{
  IIS2ICLX_ODR_FSM_12Hz5 = 0,
  IIS2ICLX_ODR_FSM_26Hz  = 1,
  IIS2ICLX_ODR_FSM_52Hz  = 2,
  IIS2ICLX_ODR_FSM_104Hz = 3,
} iis2iclx_fsm_odr_t;
int32_t iis2iclx_fsm_data_rate_set(const stmdev_ctx_t *ctx,
                                   iis2iclx_fsm_odr_t val);
int32_t iis2iclx_fsm_data_rate_get(const stmdev_ctx_t *ctx,
                                   iis2iclx_fsm_odr_t *val);

int32_t iis2iclx_fsm_init_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_fsm_init_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_long_cnt_int_value_set(const stmdev_ctx_t *ctx,
                                        uint16_t val);
int32_t iis2iclx_long_cnt_int_value_get(const stmdev_ctx_t *ctx,
                                        uint16_t *val);

int32_t iis2iclx_fsm_number_of_programs_set(const stmdev_ctx_t *ctx,
                                            uint8_t *buff);
int32_t iis2iclx_fsm_number_of_programs_get(const stmdev_ctx_t *ctx,
                                            uint8_t *buff);

int32_t iis2iclx_fsm_start_address_set(const stmdev_ctx_t *ctx,
                                       uint16_t val);
int32_t iis2iclx_fsm_start_address_get(const stmdev_ctx_t *ctx,
                                       uint16_t *val);

int32_t iis2iclx_mlc_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_mlc_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis2iclx_mlc_status_get(const stmdev_ctx_t *ctx,
                                iis2iclx_mlc_status_mainpage_t *val);

typedef enum
{
  IIS2ICLX_ODR_PRGS_12Hz5 = 0,
  IIS2ICLX_ODR_PRGS_26Hz  = 1,
  IIS2ICLX_ODR_PRGS_52Hz  = 2,
  IIS2ICLX_ODR_PRGS_104Hz = 3,
} iis2iclx_mlc_odr_t;
int32_t iis2iclx_mlc_data_rate_set(const stmdev_ctx_t *ctx,
                                   iis2iclx_mlc_odr_t val);
int32_t iis2iclx_mlc_data_rate_get(const stmdev_ctx_t *ctx,
                                   iis2iclx_mlc_odr_t *val);

int32_t iis2iclx_mlc_out_get(const stmdev_ctx_t *ctx, uint8_t *buff);

typedef struct
{
  iis2iclx_sensor_hub_1_t   sh_byte_1;
  iis2iclx_sensor_hub_2_t   sh_byte_2;
  iis2iclx_sensor_hub_3_t   sh_byte_3;
  iis2iclx_sensor_hub_4_t   sh_byte_4;
  iis2iclx_sensor_hub_5_t   sh_byte_5;
  iis2iclx_sensor_hub_6_t   sh_byte_6;
  iis2iclx_sensor_hub_7_t   sh_byte_7;
  iis2iclx_sensor_hub_8_t   sh_byte_8;
  iis2iclx_sensor_hub_9_t   sh_byte_9;
  iis2iclx_sensor_hub_10_t  sh_byte_10;
  iis2iclx_sensor_hub_11_t  sh_byte_11;
  iis2iclx_sensor_hub_12_t  sh_byte_12;
  iis2iclx_sensor_hub_13_t  sh_byte_13;
  iis2iclx_sensor_hub_14_t  sh_byte_14;
  iis2iclx_sensor_hub_15_t  sh_byte_15;
  iis2iclx_sensor_hub_16_t  sh_byte_16;
  iis2iclx_sensor_hub_17_t  sh_byte_17;
  iis2iclx_sensor_hub_18_t  sh_byte_18;
} iis2iclx_emb_sh_read_t;
