CoreMaker-lab/STM32C542CC_IIS2ICLX/STM32C5_IIS2ICLX_Project2/STM32C5_IIS3DWB_Project2_cmake/iis2iclx_reg.h
int32_t iis2iclx_sh_read_data_raw_get(const stmdev_ctx_t *ctx,
                                      iis2iclx_emb_sh_read_t *val, uint16_t len);

typedef enum
{
  IIS2ICLX_SLV_0       = 0,
  IIS2ICLX_SLV_0_1     = 1,
  IIS2ICLX_SLV_0_1_2   = 2,
  IIS2ICLX_SLV_0_1_2_3 = 3,
} iis2iclx_aux_sens_on_t;
int32_t iis2iclx_sh_slave_connected_set(const stmdev_ctx_t *ctx,
                                        iis2iclx_aux_sens_on_t val);
int32_t iis2iclx_sh_slave_connected_get(const stmdev_ctx_t *ctx,
                                        iis2iclx_aux_sens_on_t *val);

int32_t iis2iclx_sh_master_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_sh_master_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  IIS2ICLX_EXT_PULL_UP      = 0,
  IIS2ICLX_INTERNAL_PULL_UP = 1,
} iis2iclx_shub_pu_en_t;
int32_t iis2iclx_sh_pin_mode_set(const stmdev_ctx_t *ctx,
                                 iis2iclx_shub_pu_en_t val);
int32_t iis2iclx_sh_pin_mode_get(const stmdev_ctx_t *ctx,
                                 iis2iclx_shub_pu_en_t *val);

int32_t iis2iclx_sh_pass_through_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis2iclx_sh_pass_through_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  IIS2ICLX_EXT_ON_INT2_PIN = 1,
  IIS2ICLX_XL_DRDY         = 0,
} iis2iclx_start_config_t;
int32_t iis2iclx_sh_syncro_mode_set(const stmdev_ctx_t *ctx,
                                    iis2iclx_start_config_t val);
int32_t iis2iclx_sh_syncro_mode_get(const stmdev_ctx_t *ctx,
                                    iis2iclx_start_config_t *val);

typedef enum
{
  IIS2ICLX_EACH_SH_CYCLE    = 0,
  IIS2ICLX_ONLY_FIRST_CYCLE = 1,
} iis2iclx_write_once_t;
int32_t iis2iclx_sh_write_mode_set(const stmdev_ctx_t *ctx,
                                   iis2iclx_write_once_t val);
int32_t iis2iclx_sh_write_mode_get(const stmdev_ctx_t *ctx,
                                   iis2iclx_write_once_t *val);

int32_t iis2iclx_sh_reset_set(const stmdev_ctx_t *ctx);
int32_t iis2iclx_sh_reset_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef enum
{
  IIS2ICLX_SH_ODR_104Hz = 0,
  IIS2ICLX_SH_ODR_52Hz  = 1,
  IIS2ICLX_SH_ODR_26Hz  = 2,
  IIS2ICLX_SH_ODR_13Hz  = 3,
} iis2iclx_shub_odr_t;
int32_t iis2iclx_sh_data_rate_set(const stmdev_ctx_t *ctx,
                                  iis2iclx_shub_odr_t val);
int32_t iis2iclx_sh_data_rate_get(const stmdev_ctx_t *ctx,
                                  iis2iclx_shub_odr_t *val);

typedef struct
{
  uint8_t   slv0_add;
  uint8_t   slv0_subadd;
  uint8_t   slv0_data;
} iis2iclx_sh_cfg_write_t;
int32_t iis2iclx_sh_cfg_write(const stmdev_ctx_t *ctx,
                              iis2iclx_sh_cfg_write_t *val);

typedef struct
{
  uint8_t   slv_add;
  uint8_t   slv_subadd;
  uint8_t   slv_len;
} iis2iclx_sh_cfg_read_t;
int32_t iis2iclx_sh_slv0_cfg_read(const stmdev_ctx_t *ctx,
                                  iis2iclx_sh_cfg_read_t *val);
int32_t iis2iclx_sh_slv1_cfg_read(const stmdev_ctx_t *ctx,
                                  iis2iclx_sh_cfg_read_t *val);
int32_t iis2iclx_sh_slv2_cfg_read(const stmdev_ctx_t *ctx,
                                  iis2iclx_sh_cfg_read_t *val);
int32_t iis2iclx_sh_slv3_cfg_read(const stmdev_ctx_t *ctx,
                                  iis2iclx_sh_cfg_read_t *val);

int32_t iis2iclx_sh_status_get(const stmdev_ctx_t *ctx,
                               iis2iclx_status_master_t *val);

typedef enum
{
  IIS2ICLX_SEL_BY_HW   = 0x00, /* bus mode select by HW (SPI 3W disable) */
  IIS2ICLX_SPI_4W      = 0x01, /* Only SPI: SDO / SDI separated pins */
  IIS2ICLX_SPI_3W      = 0x03, /* Only SPI: SDO / SDI share the same pin */
} iis2iclx_bus_mode_t;
int32_t iis2iclx_bus_mode_set(const stmdev_ctx_t *ctx,
                              iis2iclx_bus_mode_t val);
int32_t iis2iclx_bus_mode_get(const stmdev_ctx_t *ctx,
                              iis2iclx_bus_mode_t *val);

/**
  *@}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* IIS2ICLX_REGS_H */
